squareTube/system/fvSolution
  /*--------------------------------*- C++ -*----------------------------------*\
  | =========                 |                                                 |
  | \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
  |  \\    /   O peration     | Version:  v13                                   |
  |   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
  |    \\/     M anipulation  |                                                 |
  \*---------------------------------------------------------------------------*/
  FoamFile
  {
      version     2.0;
      format      ascii;
      class       dictionary;
      object      fvSolution;
  }
  // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

  solvers
  {
      p
      {
          solver          PCG;
          preconditioner  DIC;
          tolerance       1e-06;
          relTol          0.05;
      }

      U
      {
          solver          PBiCGStab;
          preconditioner  DILU;
          tolerance       1e-05;
          relTol          0.1;
      }

      "(k|epsilon|omega)"
      {
          solver          PBiCGStab;
          preconditioner  DILU;
          tolerance       1e-05;
          relTol          0.1;
      }
  }

  SIMPLE
  {
      nNonOrthogonalCorrectors 0;
      consistent      no;

      residualControl
      {
          p               1e-5;
          U               1e-5;
          "(k|epsilon|omega)" 1e-5;
      }
  }

  relaxationFactors
  {
      fields
      {
          p               0.3;
      }
      equations
      {
          U               0.7;
          k               0.7;
          epsilon         0.7;
      }
  }

  // ************************************************************************* //

